//
//  DataSecond.swift
//  LOVEAT
//
//  Created by Марк Шнейдерман on 21.10.2020.
//

import Foundation
import UIKit


enum SecondRecipe : String{
    //
    case second_2 =
    """
    Фарш мясной - 400 г
    Капуста белокочанная - 400 г
    Рис круглозёрный - 0,5 стакана
    Яйцо - 1 шт.
    Лук репчатый - 1 шт.
    Морковь - 1 шт.
    Чеснок - 2 зубчика
    Масло подсолнечное - 1 ст. ложка
    Перец чёрный молотый - по вкусу
    Соль - по вкусу
    *
    Для соуса:
    Томатная паста - 2 ст. ложки + 1 стакан воды
    или томатный сок - 1 стакан
    *
    Для подачи:
    Сметана - по вкусу
    Зелень свежая - по вкусу
    Как приготовить ленивые голубцы в духовке:
    1. Капусту мелко нарезать и залить кипятком минут на 10. Откинуть капусту на дуршлаг и дать жидкости стечь.
    2. Рис помыть и отварить на небольшом огне до полуготовности, примерно 10-12 минут после закипания.
    3. Лук очистить и мелко нарезать. Морковь очистить и натереть на крупной тёрке. Чеснок очистить и выдавить через пресс.
    4. Обжарить лук и морковь на подсолнечном масле в течение 7 минут на среднем огне.
    5. Смешать фарш, капусту, рис и обжаренные овощи. Добавить яйцо, чёрный молотый перец, измельчённый чеснок и соль. Всё хорошо перемешать.
    6. Из фарша мокрыми руками сформировать котлеты.
    7. Томатную пасту развести водой. Уложить котлеты в форму для запекания, залить томатной пастой, разведённой в воде (или томатным соком).
    8. Включить духовку и разогреть до 180°С. Запекать ленивые голубцы в духовке в течение одного часа.
    9. Подавать ленивые голубцы со сметаной и свежей зеленью. На гарнир к таким голубцам можно подать отварной картофель или картофельное пюре.
    Приятного аппетита!
    """
    //
    case second_3 =
    """
    Курица - 700 г
    Лук репчатый - 2 шт.
    Помидор - 1 шт.
    Морковь - 1 шт.
    Перец болгарский - 0,5 шт.
    Паста томатная - 2 ст. л.
    Макароны (лапша длинная) - 350 г
    Масло подсолнечное - 2 ст. л.
    Перец черный молотый
    Соль мелкая

    Как приготовить лагман из курицы:
    1. Курицу вымыть, нарезать кусочками. На сковороде разогреваем масло, и обжариваем курицу в течении 10 мин.
    2. Лук нарезаем полукольцами и добавляем к курице. Обжариваем в течении 10 минут.
    3. Морковь нарезаем кубиками и отправляем к мясу и луку. Тушим 5 минут.
    4. Помидор обдать кипятком и снять кожицу. Нарезаем помидоры и перец кубиками, добавляем к мясу с овощами. Также добавляем томатную пасту, перец, соль.
    5. Перемешиваем и тушим под закрытой крышкой 15 минут.
    6. Отвариваем макароны и перемешиваем с курицей с овощами.
    В итоге получился лагман из курицы, пусть не классический, но очень вкусный!
    """
    //
    case second_4 =
    """
    Как приготовить куриные рулетики с сыром:Режем куриную грудку тонкими ломтиками.Отбиваем нарезанное куриное
    филе.Солим, перчим и смазываем измельченным чесноком.На край каждого кусочка филе кладем 1 ст. л. тертого
    сыра и порезанную зелень.Формируем рулетик из куриного филе с сыром и зеленью, подворачивая с боков, чтобы
    сыр при приготовлении не вытек. Скрепляем края половинками зубочисток.Обваливаем куриные рулетики в муке.
    Обжариваем рулетики из куриного филе с сыром и зеленью в разогретом растительном масле до готовности (до
    румяной корочки).Удаляем зубочистки и подаем куриные рулетики к столу.
    """
    //
    case second_5 =
    """
    Картофель - 20 шт.
    Лук репчатый - 3-4 шт.
    Мясо (курица или свинина) - у меня 15 куриных ножек
    Сыр - 300-400 г
    Майонез - 2 упаковки (примерно 500 г)
    Соль
    Специи
    Зелень
    
    Нарезать лук полукольцами и замариновать его в майонезе.Нарезать картошку, посолить, замариновать в майонезе.
    Курицу (не поверите!) тоже замариновать в майонезе!Посолить, добавить специи по вкусу.Через час всё выложить на противень слоями:
    1 - картошка;
    2 - лук;
    3 - мясо
    Поставить в духовку и готовить при температуре 220 градусов 40-50 минут.
    """
    //
    case second_6 =
    """
    Гречневая крупа - 1 стакан
    Фарш мясной - 300 г
    Лук репчатый - 1 шт.
    Морковь - 1 шт.
    Чеснок - 2 зубка
    Паста томатная - 2 ст. ложки
    Масло подсолнечное - 20 г
    Соль - по вкусу
    
    Как приготовить гречку по-купечески:
    1. Гречку промыть. Смазать сковороду маслом (можно даже сливочным) и высыпать туда крупу, подсушить на среднем огне.
    2. Натереть морковь, порезать лук (это можно делать во время "сушки" гречневой крупы). Обжарить в растительном масле до золотистого цвета.
    3. Далее добавляем фарш, разбивая комочки.
    4. И в конце добавить томатную пасту (или порезанные помидоры БЕЗ кожицы). Тщательно перемешать. И жарить на среднем огне минут 5 (пока фарш не потемнеет)
    5. К мясу и овощам выложить гречку.
    6. Залить кипятком так, чтобы гречка была слегка прикрыта водой. Посолить.
    7. Тушить гречку по-купечески на медленном огне под крышкой, пока вода не испарится. Если гречка еще не готова, долить еще немного воды, повторить действия.
    8. В готовую гречку по-купечески добавить мелко порезанный чеснок (или использовать чесночницу), перемешать. Можно добавить черный молотый перец и лавровый лист.
    Подавать гречку по-купечески горячей.
    """
    //
    case second_7 =
    """
    Макароны - 150 г
    Мясо без костей (свинина) - 300 г
    Лук - 1 средний
    Морковь - 1 небольшая
    Помидор - 1 небольшой
    Кетчуп (томатная паста) - 1,5 ст.л.
    Вода - 50 мл
    Свежая зелень
    Соль приправы по вкусу
    
    Нашинкованный лук и нарезанную кубиками морковь обжарить.Добавить мясо, на сильном огне, постоянно
    помешивая, обжарить. Слегка посолить. Убавить огонь, закрыть крышкой и чуть потушить 10-15 минут.Параллельно
    сварить макароны обычным способом.В мясо добавить помидор, кетчуп, воду, соль, специи и тушить ещё 15-20
    минут (мясо станет мягким).Добавить макароны, зелень, хорошо перемешать.
    """
    //
    case second_8 =
    """
    Фарш мясной - 500 г
    Яйца - 1 шт.
    Лук репчатый - 2 шт.
    Чеснок - 4 зубчика
    Сметана - 250 г
    Сухари панировочные - 3 ст. ложки
    Масло растительное - 3 ст. ложки (сколько уйдет)
    Соль - 1 ч. ложка (по вкусу)
    Перец - 0,25 ч. ложки (по вкусу)

    
    Подготавливаем продукты для тефтелей.Фарш обязательно должен быть жирным (иначе тефтели будут жесткими),
    лучше смешать пополам говяжий и свиной фарш.Как приготовить тефтели в сметанном соусе: Лук чистим, моем и
    мелко рубим. Делим на две части.Чистим чеснок, мелко рубим.Замешиваем фарш, выкладываем в миску мелко \
    порубленную одну луковицу, яйцо, панировочные сухари, соль и перец.Все перемешиваем хорошо и долго, отбиваем
    фарш, оставляем открытым на 20 минут.Затем лепим мокрыми руками тефтели (размером с небольшой
    мандарин).Разогреваем сковороду, наливаем масло. В горячее масло выкладываем тефтели, обжариваем в
    раскаленном масле (не панируем тефтели ничем!). Сперва с одной стороны около 1-2 минут, до олотистости.
    Затем переворачиваем и жарим тефтели с другой стороны до золотистости 1-2 минуты.Выкладываем тефтели из
    сковороды.На оставшемся жиру приготовить сметанный соус для тефтелей. Для этого на сковороду выложить вторую
    луковицу, обжарить на среднем огне, помешивая, до золотистости (1-2 минуты).Влить сметану.Обжарить до
    золотистого цвета, помешивая, 2-3 минуты. Добавить чеснок, перемешать.Затем тефтели вернуть обратно в
    сковородку с соусом.Потушить тефтели в сметанном соусе под крышкой 15 минут на самом маленьком огне.
    """
    //
    case second_9 =
    """
    Грудка куриная - 400 г
    Лапша удон - 200 г
    Перец сладкий - 120 г
    Морковь - 70 г
    Лук репчатый - 70 г
    Чеснок - 10 г
    Корень имбиря - 20 г
    Перец красный чили - по вкусу
    Лук зелёный - 15 г
    Масло растительное - 3 ст. ложки
    Соус терияки - 120 г
    Соус соевый - 50 г
    Соль - по вкусу
    Перец чёрный молотый - 1 ч. ложка
    Кунжут обжаренный - 1 ч. ложка
    
    Куриную грудку нарезать небольшими полосками, посолить и поперчить (по 1/2 ч. ложки) – это сделает вкус куриного мяса более насыщенным.
    Корень имбиря очистить и мелко нарезать.
    Хорошо разогреть сковороду, налить растительное масло и обжарить имбирь 1-2 минуты на среднем огне.
    Добавить в сковороду кусочки курицы и обжарить 5 минут на среднем огне, до золотистости, иногда помешивая.
    Репчатый лук очистить и мелко нарезать.
    Добавить лук в сковороду с курицей и обжарить 2 минуты на среднем огне.
    Морковь очистить и нарезать мелкой длинной соломкой.
    Добавить морковь в сковороду к курице и луку. Обжарить еще 2 минуты.
    В кастрюле нагреть воду, подсолить (1/2 ч. ложки) и отварить лапшу удон согласно инструкции на упаковке.
    Сладкий перец очистить от семян и плодоножки и нарезать продольными полосками.
    Добавить сладкий перец в сковороду. Обжаривать 1 минуту на среднем огне.
    Чеснок очистить и мелко нарезать.
    Добавить в сковороду чеснок.
    Красный перец чили нарезать колечками и тоже добавить в сковороду. Перемешать.
    Добавить соевый соус и соус терияки, перемешать.
    Добавить в сковороду соль по вкусу, оставшийся чёрный молотый перец и 100 мл воды. Перемешать и накрыть
    крышкой. Тушить курицу с овощами в соусе терияки 1 минуту.
    Слить воду, в которой варилась лапша удон, и промыть лапшу под проточной холодной водой. Добавить лапшу в
    сковороду с курицей и овощами. Тщательно перемешать, накрыть крышкой и готовить лапшу удон с курицей и
    овощами в соусе терияки 1-2 минуты на слабом огне.
    Зелёный лук крупно нарезать.
    Выключить плиту. Добавить в сковороду зелёный лук и перемешать. Посыпать кунжутом.
    """
    //
    case second_10 =
    """
    Картофель - 1 кг
    Масло растительное - 3-4 ст. ложки
    Соль - по вкусу
    Зелень для подачи (по желанию)
    Пряности (по вкусу):
    Перец душистый молотый
    Чеснок гранулированный
    Паприка сладкая молотая
    Приправа для картофеля

    Картошка по-деревенски будет прекрасным гарниром к мясу, рыбе и различным бургерам. Кроме того, картофель,
    запеченный в духовке, намного полезнее жареного картофеля и, тем более, картофеля фри.
    Процесс приготовления картошки по-деревенски занимает менее часа и большую часть этого времени она просто
    жарится в духовке, пока вы будете заниматься своими любимыми делами. ;)
    Самый главный плюс картошки по деревенски - это то, что ее не нужно чистить, а это очень большая экономия
    времени.
    """
    //
    case second_11 =
    """
    Куриное филе - 2 шт. (500 г)
    Перец сладкий - 1 шт. (150 г)
    Морковь - 1 шт. (100 г)
    Кетчуп томатный - 100 г
    Перец острый молотый - 1 ч. ложка
    или перец острый свежий - 0,5 шт. (по вкусу)
    Сахар - 1 ст. ложка
    Крахмал кукурузный - 1 ст. ложка
    Соевый соус - 3 ст. ложки
    Масло растительное - 1 ст. ложка
    Имбирь свежий (корень) - 10 г
    Кунжут (семена) - 1 ч. ложка

    Подготовьте все необходимые ингредиенты.
    Блюдо готовится быстро, поэтому всё должно быть под рукой.
    Вместо острого молотого перца можно взять свежий острый перец. Вымойте, очистите и нарежьте его колечками.
    Куриное филе нарежьте небольшими кубиками размером примерно 2х2 см.
    Сладкий перец очистите от семян и хвостика и нарежьте кусочками примерно такого же размера, как и куриное
    филе. Морковь очистите и нарежьте полукружиями.
    Разогрейте в сковороде с толстым дном или сотейнике растительное масло. Обжарьте на нём куриное филе на
    сильном огне до выпаривания жидкости, примерно 7-8 минут.
    Добавьте в сковороду морковь и перец, обжарьте всё вместе на среднем огне ещё 5-7 минут, помешивая.
    Имбирь натрите на мелкой тёрке.
    Добавьте в сковороду острый молотый перец (или колечки острого перца) и имбирь.
    Переложите в сковороду томатный кетчуп, перемешайте.
    Добавьте соевый соус, перемешайте и тушите на среднем огне 5-7 минут.
    Добавьте в сковороду сахар и крахмал, перемешайте. Прогрейте блюдо на небольшом огне ещё 2 минуты, до
    загустения соуса.
    Курица, тушенная в кисло-сладком соусе с болгарским перцем и морковью, готова.
    Снимите сковороду с огня.
    Присыпьте курицу с овощами семенами кунжута.
    Такое блюдо из курицы замечательно сочетается с отварным рисом. Нежные кусочки куриного филе и сочные овощи
    в оригинальном кисло-сладком соусе с остринкой - идеально!
    """
    //
    case second_12 =
    """
    Продукты
    Спагетти - 250 г
    Куриные бедра - 3-4 шт.
    Помидоры черри - 250-300 г
    Сыр чеддер - 150 г
    Перец чили, хлопья - 1/2 ч. л.
    Чеснок - 2-3 зубчика
    Петрушка свежая
    Перец черный молотый
    Соль

    
    Отварить макароны, как написано на упаковке, в подсоленной воде.
    Оставить полчашки жидкости, в которой варились макароны.
    Откинуть спагетти на дуршлаг.
    В холодное оливковое масло на сковороде добавить хлопья перца чили, нагреть.
    С куриных бедер снять шкуру, отделить мясо от костей. Нарезать куриное мясо небольшими кусочками.
    Отправить курицу на сковороду.
    Обжарить курицу в масле и вынуть из сковороды.
    Чеснок измельчить ножом.
    Помидоры черри разрезать пополам.
    Отправить чеснок на сковородку.
    Добавить нарезанные помидоры к чесноку.
    Добавить курицу к помидорам.
    Добавить макароны. Посолить, поперчить.
    Натереть сыр на крупной терке.
    Посыпать спагетти с курицей и помидорами черри тертым сыром.
    Перемешать.
    Мелко нарезать зелень петрушки.
    Посыпать спагетти с курицей, помидорам и сыром нарезанной петрушкой.
    """
}

enum productNameSecond : String {
    case second_2 =  "Ленивые голубцы в духовке"
    case second_3 =  "Лагман с курицей"
    case second_4 =  "Куриные рулетики с сыром"
    case second_5 =  "Слоеная картошка"
    case second_6 =  "Гречка по-купечески"
    case second_7 =  "Макароны с мясом"
    case second_8 =  "Тефтели в сметанном соусе"
    case second_9 =  "Лапша удон с курицей"
    case second_10 = "Картошка по-деревенски"
    case second_11 = "Курица, тушенная в кисло-сладком соусе"
    case second_12 = "Спаггети с курицей и помидорами черри"
}

struct secondModel {
    var product : String
    var secondRecipe : String
    var photo : UIImage
}
